ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/gpio.c
        assert((0xFFFF != baseAddress) );
        if (0xFFFF == baseAddress)
                return;

        switch (selectedPort) {
        case GPIO_PORT_P1:
        case GPIO_PORT_P3:
        case GPIO_PORT_P5:
        case GPIO_PORT_P7:
        case GPIO_PORT_P9:
        {
                switch (mode) {
                case GPIO_PRIMARY_MODULE_FUNCTION:
                        HWREG8(baseAddress + OFS_P1SEL0) |= (uint8_t)selectedPins;
                        HWREG8(baseAddress + OFS_P1SEL1) &= (uint8_t) ~selectedPins;
                        HWREG8(baseAddress + OFS_P1DIR) |= (uint8_t)selectedPins;
                        break;
                case GPIO_SECONDARY_MODULE_FUNCTION:
                        HWREG8(baseAddress + OFS_P1SEL0) &= (uint8_t) ~selectedPins;
                        HWREG8(baseAddress + OFS_P1SEL1) |= (uint8_t)selectedPins;
                        HWREG8(baseAddress + OFS_P1DIR) |= (uint8_t)selectedPins;
                        break;
                case GPIO_TERNARY_MODULE_FUNCTION:
                        HWREG8(baseAddress + OFS_P1SEL0) |= (uint8_t)selectedPins;
                        HWREG8(baseAddress + OFS_P1SEL1) |= (uint8_t)selectedPins;
                        HWREG8(baseAddress + OFS_P1DIR) |= (uint8_t)selectedPins;
                }
                break;
        }
        case GPIO_PORT_P2:
        case GPIO_PORT_P4:
        case GPIO_PORT_P6:
        case GPIO_PORT_P8:
        case GPIO_PORT_P10:
        {
                switch (mode) {
                case GPIO_PRIMARY_MODULE_FUNCTION:
                        HWREG8(baseAddress + OFS_P2SEL0) |= (uint8_t)selectedPins;
                        HWREG8(baseAddress + OFS_P2SEL1) &= (uint8_t) ~selectedPins;
                        HWREG8(baseAddress + OFS_P2DIR) |= (uint8_t)selectedPins;
                        break;
                case GPIO_SECONDARY_MODULE_FUNCTION:
                        HWREG8(baseAddress + OFS_P2SEL0) &= (uint8_t) ~selectedPins;
                        HWREG8(baseAddress + OFS_P2SEL1) |= (uint8_t)selectedPins;
                        HWREG8(baseAddress + OFS_P2DIR) |= (uint8_t)selectedPins;
                        break;
                case GPIO_TERNARY_MODULE_FUNCTION:
                        HWREG8(baseAddress + OFS_P2SEL0) |= (uint8_t)selectedPins;
                        HWREG8(baseAddress + OFS_P2SEL1) |= (uint8_t)selectedPins;
                        HWREG8(baseAddress + OFS_P2DIR) |= (uint8_t)selectedPins;
                }
                break;
        }
        case GPIO_PORT_PA:
        case GPIO_PORT_PB:
        case GPIO_PORT_PC:
        case GPIO_PORT_PD:
        case GPIO_PORT_PE:
        case GPIO_PORT_PF:
        case GPIO_PORT_PJ:
        case GPIO_PORT_P11:
        {
                switch (mode) {
                case GPIO_PRIMARY_MODULE_FUNCTION:
                        HWREG16(baseAddress + OFS_PASEL0) |= selectedPins;
                        HWREG16(baseAddress + OFS_PASEL1) &= ~selectedPins;
                        HWREG16(baseAddress + OFS_PADIR) |= selectedPins;
                        break;
                case GPIO_SECONDARY_MODULE_FUNCTION:
                        HWREG16(baseAddress + OFS_PASEL0) &= ~selectedPins;
                        HWREG16(baseAddress + OFS_PASEL1) |= selectedPins;
                        HWREG16(baseAddress + OFS_PADIR) |= selectedPins;
                        break;
                case GPIO_TERNARY_MODULE_FUNCTION:
                        HWREG16(baseAddress + OFS_PASEL0) |= selectedPins;
                        HWREG16(baseAddress + OFS_PASEL1) |= selectedPins;
                        HWREG16(baseAddress + OFS_PADIR) |= selectedPins;
                }
                break;
        }
        }
}

//*****************************************************************************
//
//! \brief This function configures the peripheral module function in the input
//! direction for the selected pin for either primary, secondary or ternary
//! module function modes.
//!
//! \param selectedPort is the selected port.
//!        Valid values are:
//!        - \b GPIO_PORT_P1
//!        - \b GPIO_PORT_P2
//!        - \b GPIO_PORT_P3
//!        - \b GPIO_PORT_P4
//!        - \b GPIO_PORT_P5
//!        - \b GPIO_PORT_P6
//!        - \b GPIO_PORT_P7
//!        - \b GPIO_PORT_P8
//!        - \b GPIO_PORT_P9
//!        - \b GPIO_PORT_P10
//!        - \b GPIO_PORT_P11
//!        - \b GPIO_PORT_PA
//!        - \b GPIO_PORT_PB
//!        - \b GPIO_PORT_PC
//!        - \b GPIO_PORT_PD
//!        - \b GPIO_PORT_PE
//!        - \b GPIO_PORT_PF
//!        - \b GPIO_PORT_PJ
//! \param selectedPins is the specified pin in the selected port.
//!        Mask value is the logical OR of any of the following:
//!        - \b GPIO_PIN0
//!        - \b GPIO_PIN1
//!        - \b GPIO_PIN2
//!        - \b GPIO_PIN3
//!        - \b GPIO_PIN4
//!        - \b GPIO_PIN5
//!        - \b GPIO_PIN6
//!        - \b GPIO_PIN7
//!        - \b GPIO_PIN8
//!        - \b GPIO_PIN9
//!        - \b GPIO_PIN10
//!        - \b GPIO_PIN11
//!        - \b GPIO_PIN12
//!        - \b GPIO_PIN13
//!        - \b GPIO_PIN14
//!        - \b GPIO_PIN15
//! \param mode is the specified mode that the pin should be configured for the
//!        module function.
//!        Valid values are:
//!        - \b GPIO_PRIMARY_MODULE_FUNCTION
//!        - \b GPIO_SECONDARY_MODULE_FUNCTION
//!        - \b GPIO_TERNARY_MODULE_FUNCTION
//!
//! Modified bits of \b PxDIR register and bits of \b PxSEL register.
//!
//! \return None
//
//*****************************************************************************
void GPIO_setAsPeripheralModuleFunctionInputPin(
        uint8_t selectedPort,
        uint16_t selectedPins,
        uint8_t mode
        )
{
        assert((GPIO_PORT_P1 == selectedPort) || (GPIO_PORT_P2 == selectedPort) ||
               (GPIO_PORT_P3 == selectedPort) || (GPIO_PORT_P4 == selectedPort) ||
               (GPIO_PORT_P5 == selectedPort) || (GPIO_PORT_P6 == selectedPort) ||
               (GPIO_PORT_P7 == selectedPort) || (GPIO_PORT_P8 == selectedPort) ||
               (GPIO_PORT_P9 == selectedPort) || (GPIO_PORT_P10 == selectedPort) ||
               (GPIO_PORT_P11 == selectedPort) || (GPIO_PORT_PA == selectedPort) ||
               (GPIO_PORT_PB == selectedPort) || (GPIO_PORT_PC == selectedPort) ||
               (GPIO_PORT_PD == selectedPort) || (GPIO_PORT_PE == selectedPort) ||
               (GPIO_PORT_PF == selectedPort) || (GPIO_PORT_PJ == selectedPort)
               );

        assert(0x00 != (selectedPins & (GPIO_PIN0 + GPIO_PIN1 + GPIO_PIN2 +
                                        GPIO_PIN3 + GPIO_PIN4 + GPIO_PIN5 +
                                        GPIO_PIN6 + GPIO_PIN7 + GPIO_PIN8 +
                                        GPIO_PIN9 + GPIO_PIN10 + GPIO_PIN11 +
                                        GPIO_PIN12 + GPIO_PIN13 + GPIO_PIN14 +
                                        GPIO_PIN15
                                        )));

        uint32_t baseAddress  = privateGPIOGetBaseAddress(selectedPort);

