ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/gpio.c
        assert((0xFFFF != baseAddress) );

        uint8_t returnValue = 0x0;

        switch (selectedPort) {
        case GPIO_PORT_P1:
        case GPIO_PORT_P3:
        case GPIO_PORT_P5:
        case GPIO_PORT_P7:
        case GPIO_PORT_P9:
                returnValue = (HWREG8(baseAddress + OFS_P1IFG) & ((uint8_t)selectedPins));
                break;
        case GPIO_PORT_P2:
        case GPIO_PORT_P4:
        case GPIO_PORT_P6:
        case GPIO_PORT_P8:
        case GPIO_PORT_P10:
                returnValue = (HWREG8(baseAddress + OFS_P2IFG) & ((uint8_t)selectedPins));
                break;
        case GPIO_PORT_PA:
        case GPIO_PORT_PB:
        case GPIO_PORT_PC:
        case GPIO_PORT_PD:
        case GPIO_PORT_PE:
        case GPIO_PORT_PF:
        case GPIO_PORT_PJ:
        case GPIO_PORT_P11:
                returnValue = (HWREG16(baseAddress + OFS_PAIFG) & selectedPins);
                break;
        }

        return returnValue;
}

//*****************************************************************************
//
//! \brief This function clears the interrupt flag on the selected pin. Note
//! that only Port 1,2,A have this capability
//!
//! \param selectedPort is the selected port.
//!        Valid values are:
//!        - \b GPIO_PORT_P1
//!        - \b GPIO_PORT_P2
//!        - \b GPIO_PORT_PA
//! \param selectedPins is the specified pin in the selected port.
//!        Mask value is the logical OR of any of the following:
//!        - \b GPIO_PIN0
//!        - \b GPIO_PIN1
//!        - \b GPIO_PIN2
//!        - \b GPIO_PIN3
//!        - \b GPIO_PIN4
//!        - \b GPIO_PIN5
//!        - \b GPIO_PIN6
//!        - \b GPIO_PIN7
//!        - \b GPIO_PIN8
//!        - \b GPIO_PIN9
//!        - \b GPIO_PIN10
//!        - \b GPIO_PIN11
//!        - \b GPIO_PIN12
//!        - \b GPIO_PIN13
//!        - \b GPIO_PIN14
//!        - \b GPIO_PIN15
//!
//! Modified bits of \b PxIFG register.
//!
//! \return None
//
//*****************************************************************************
void GPIO_clearInterruptFlag(
        uint8_t selectedPort,
        uint16_t selectedPins
        )
{
        assert((GPIO_PORT_P1 == selectedPort) || (GPIO_PORT_P2 == selectedPort) ||
               (GPIO_PORT_P3 == selectedPort) || (GPIO_PORT_P4 == selectedPort) ||
               (GPIO_PORT_P5 == selectedPort) || (GPIO_PORT_P6 == selectedPort) ||
               (GPIO_PORT_P7 == selectedPort) || (GPIO_PORT_P8 == selectedPort) ||
               (GPIO_PORT_P9 == selectedPort) || (GPIO_PORT_P10 == selectedPort) ||
               (GPIO_PORT_P11 == selectedPort) || (GPIO_PORT_PA == selectedPort) ||
               (GPIO_PORT_PB == selectedPort) || (GPIO_PORT_PC == selectedPort) ||
               (GPIO_PORT_PD == selectedPort) || (GPIO_PORT_PE == selectedPort) ||
               (GPIO_PORT_PF == selectedPort) || (GPIO_PORT_PJ == selectedPort)
               );

        assert(0x00 != (selectedPins & (GPIO_PIN0 + GPIO_PIN1 + GPIO_PIN2 +
                                        GPIO_PIN3 + GPIO_PIN4 + GPIO_PIN5 +
                                        GPIO_PIN6 + GPIO_PIN7 + GPIO_PIN8 +
                                        GPIO_PIN9 + GPIO_PIN10 + GPIO_PIN11 +
                                        GPIO_PIN12 + GPIO_PIN13 + GPIO_PIN14 +
                                        GPIO_PIN15
                                        )));

        uint32_t baseAddress  = privateGPIOGetBaseAddress(selectedPort);

        assert((0xFFFF != baseAddress) );
        if (0xFFFF == baseAddress)
                return;

        switch (selectedPort) {
        case GPIO_PORT_P1:
        case GPIO_PORT_P3:
        case GPIO_PORT_P5:
        case GPIO_PORT_P7:
        case GPIO_PORT_P9:
                HWREG8(baseAddress + OFS_P1IFG) &= (uint8_t) ~selectedPins;
                break;
        case GPIO_PORT_P2:
        case GPIO_PORT_P4:
        case GPIO_PORT_P6:
        case GPIO_PORT_P8:
        case GPIO_PORT_P10:
                HWREG8(baseAddress + OFS_P2IFG) &= (uint8_t) ~selectedPins;
                break;
        case GPIO_PORT_PA:
        case GPIO_PORT_PB:
        case GPIO_PORT_PC:
        case GPIO_PORT_PD:
        case GPIO_PORT_PE:
        case GPIO_PORT_PF:
        case GPIO_PORT_PJ:
        case GPIO_PORT_P11:
                HWREG16(baseAddress + OFS_PAIFG) &= ~selectedPins;
                break;
        }
}

//*****************************************************************************
//
//! \brief This function selects on what edge the port interrupt flag should be
//! set for a transition
//!
//! \param selectedPort is the selected port.
//!        Valid values are:
//!        - \b GPIO_PORT_P1
//!        - \b GPIO_PORT_P2
//!        - \b GPIO_PORT_P3
//!        - \b GPIO_PORT_P4
//!        - \b GPIO_PORT_P5
//!        - \b GPIO_PORT_P6
//!        - \b GPIO_PORT_P7
//!        - \b GPIO_PORT_P8
//!        - \b GPIO_PORT_P9
//!        - \b GPIO_PORT_P10
//!        - \b GPIO_PORT_P11
//!        - \b GPIO_PORT_PA
//!        - \b GPIO_PORT_PB
//!        - \b GPIO_PORT_PC
//!        - \b GPIO_PORT_PD
//!        - \b GPIO_PORT_PE
//!        - \b GPIO_PORT_PF
//!        - \b GPIO_PORT_PJ
//! \param selectedPins is the specified pin in the selected port.
//!        Mask value is the logical OR of any of the following:
//!        - \b GPIO_PIN0
//!        - \b GPIO_PIN1
//!        - \b GPIO_PIN2
//!        - \b GPIO_PIN3
//!        - \b GPIO_PIN4
//!        - \b GPIO_PIN5
//!        - \b GPIO_PIN6
//!        - \b GPIO_PIN7
//!        - \b GPIO_PIN8
//!        - \b GPIO_PIN9
//!        - \b GPIO_PIN10
//!        - \b GPIO_PIN11
//!        - \b GPIO_PIN12
//!        - \b GPIO_PIN13
//!        - \b GPIO_PIN14
//!        - \b GPIO_PIN15
//! \param edgeSelect specifies what transition sets the interrupt flag
//!        Valid values are:
//!        - \b GPIO_HIGH_TO_LOW_TRANSITION
//!        - \b GPIO_LOW_TO_HIGH_TRANSITION
//!
//! Modified bits of \b PxIES register.
//!
//! \return None
//
//*****************************************************************************
void GPIO_interruptEdgeSelect(
        uint8_t selectedPort,
        uint16_t selectedPins,
        uint8_t edgeSelect
        )
{
        assert((GPIO_PORT_P1 == selectedPort) || (GPIO_PORT_P2 == selectedPort) ||
               (GPIO_PORT_P3 == selectedPort) || (GPIO_PORT_P4 == selectedPort) ||
               (GPIO_PORT_P5 == selectedPort) || (GPIO_PORT_P6 == selectedPort) ||
               (GPIO_PORT_P7 == selectedPort) || (GPIO_PORT_P8 == selectedPort) ||
               (GPIO_PORT_P9 == selectedPort) || (GPIO_PORT_P10 == selectedPort) ||
               (GPIO_PORT_P11 == selectedPort) || (GPIO_PORT_PA == selectedPort) ||
               (GPIO_PORT_PB == selectedPort) || (GPIO_PORT_PC == selectedPort) ||
               (GPIO_PORT_PD == selectedPort) || (GPIO_PORT_PE == selectedPort) ||
               (GPIO_PORT_PF == selectedPort) || (GPIO_PORT_PJ == selectedPort)
               );

        assert(0x00 != (selectedPins & (GPIO_PIN0 + GPIO_PIN1 + GPIO_PIN2 +
                                        GPIO_PIN3 + GPIO_PIN4 + GPIO_PIN5 +
                                        GPIO_PIN6 + GPIO_PIN7 + GPIO_PIN8 +
                                        GPIO_PIN9 + GPIO_PIN10 + GPIO_PIN11 +
                                        GPIO_PIN12 + GPIO_PIN13 + GPIO_PIN14 +
                                        GPIO_PIN15
                                        )));

        uint32_t baseAddress  = privateGPIOGetBaseAddress(selectedPort);

