ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/gpio.c
        assert((0xFFFF != baseAddress) );
        if (0xFFFF == baseAddress)
                return;

        assert((edgeSelect == GPIO_HIGH_TO_LOW_TRANSITION) ||
               (edgeSelect == GPIO_LOW_TO_HIGH_TRANSITION)
               );

        switch (selectedPort) {
        case GPIO_PORT_P1:
        case GPIO_PORT_P3:
        case GPIO_PORT_P5:
        case GPIO_PORT_P7:
        case GPIO_PORT_P9:
                if (GPIO_LOW_TO_HIGH_TRANSITION == edgeSelect)
                        HWREG8(baseAddress + OFS_P1IES) &= (uint8_t) ~selectedPins;
                else
                        HWREG8(baseAddress + OFS_P1IES) |= (uint8_t)selectedPins;
                break;

        case GPIO_PORT_P2:
        case GPIO_PORT_P4:
        case GPIO_PORT_P6:
        case GPIO_PORT_P8:
        case GPIO_PORT_P10:
                if (GPIO_LOW_TO_HIGH_TRANSITION == edgeSelect)
                        HWREG8(baseAddress + OFS_P2IES) &= (uint8_t) ~selectedPins;
                else
                        HWREG8(baseAddress + OFS_P2IES) |= (uint8_t)selectedPins;
                break;

        case GPIO_PORT_PA:
        case GPIO_PORT_PB:
        case GPIO_PORT_PC:
        case GPIO_PORT_PD:
        case GPIO_PORT_PE:
        case GPIO_PORT_PF:
        case GPIO_PORT_PJ:
        case GPIO_PORT_P11:
                if (GPIO_LOW_TO_HIGH_TRANSITION == edgeSelect)
                        HWREG16(baseAddress + OFS_PAIES) &= ~selectedPins;
                else
                        HWREG16(baseAddress + OFS_PAIES) |= selectedPins;
                break;
        }
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for gpio_api
//! @}
//
//*****************************************************************************
